app/controllers/articles_controller.rb

  def update
    @article = Article.find(params[:id])
    @article.update(article_params)
---
SELECT  "articles".* FROM "articles" WHERE "articles"."id" = ? LIMIT ?  [["id", 21], ["LIMIT", 1]]
UPDATE "articles" SET "image_updated_at" = ?, "updated_at" = ?, "image_file_name" = ? WHERE "articles"."id" = ?  [["image_updated_at", 2016-10-27 04:38:30 UTC], ["updated_at", 2016-10-27 04:38:30 UTC], ["image_file_name", "65379192.jpg"], ["id", 25]]